// httpStatus.ts
export enum HTTP_STATUS {
  // ------------------ Success (2xx) ------------------
  OK = 200,                  // درخواست موفق، پاسخ شامل داده است
  CREATED = 201,             // موفقیت‌آمیز و یک منبع جدید ایجاد شد
  ACCEPTED = 202,            // درخواست پذیرفته شد ولی هنوز پردازش نشده
  NO_CONTENT = 204,          // موفقیت‌آمیز اما داده‌ای برای ارسال نیست

  // ------------------ Redirection (3xx) ------------------
  MOVED_PERMANENTLY = 301,   // URL دائماً تغییر کرده
  FOUND = 302,                // URL موقتاً تغییر کرده
  NOT_MODIFIED = 304,         // داده تغییر نکرده، از کش استفاده شود

  // ------------------ Client Errors (4xx) ------------------
  BAD_REQUEST = 400,          // درخواست اشتباه یا ناقص
  UNAUTHORIZED = 401,         // نیاز به احراز هویت
  FORBIDDEN = 403,            // دسترسی به منبع غیرمجاز
  NOT_FOUND = 404,            // منبع پیدا نشد
  METHOD_NOT_ALLOWED = 405,   // متد HTTP مجاز نیست
  CONFLICT = 409,             // تضاد با وضعیت فعلی منبع
  UNPROCESSABLE_ENTITY = 422, // داده درست است ولی قابل پردازش نیست
  TOO_MANY_REQUESTS = 429,     // تعداد درخواست‌ها بیش از حد مجاز است

  // ------------------ Server Errors (5xx) ------------------
  INTERNAL_SERVER_ERROR = 500, // خطای داخلی سرور
  NOT_IMPLEMENTED = 501,       // سرور از قابلیت درخواست پشتیبانی نمی‌کند
  BAD_GATEWAY = 502,           // پاسخ نامعتبر از سرور دیگر
  SERVICE_UNAVAILABLE = 503,   // سرور موقتا در دسترس نیست
}